Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: གཤེ་བ་དང་། བསྡིགས་པ་དང་། སྨད་པ་དང་། བཤུང་བ་དང་། བསྡིགས་མོ་བྱེད་པ་ཐམས་ཅད་བཟོད་པ་དང་། ཡོད་པའམ། མེད་པས་གླེངས་པས་ཀྱང་མི་ཁྲོ་བ་དང་། འཁོན་དུ་མི་འཛིན་པ་དང་། བག་ལ་ཉལ་སྤོང་བའོ། །
en: It is accepting being scolded, slandered, belittled, complained about, and intimidated. It is not getting angry when somebody says something negative about them, whether true or false. It is casting aside all forms of holding a grudge, including the habitual tendencies for doing so.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལ་ཐབས་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ངན་དུ་བརྗོད་པ་དང་། ངན་དུ་སྨྲས་པའི་ཚིག་གི་ལམ་དང་། གཤེ་བ་དང་བསྡིགས་པ་དག་ཕ་རོལ་ལས་ཐོས་ནས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: “Sāgaramati, when bodhisattva great beings who are skilled in means hear mean utterances, mean words, scolding, and words of intimidation spoken by someone else, they perfect their cultivation of the six perfections.

source: བློ་གྲོས་རྒྱ་མཚོ་ཇི་ལྟར་ན་ཐབས་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ངན་དུ་བརྗོད་པ་དང་ངན་དུ་སྨྲས་པའི་ཚིག་གི་ལམ་དང་། གཤེ་བ་དང་བསྡིགས་པ་དག་ཕ་རོལ་ལས་ཐོས་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེ་ན
en: How do bodhisattva great beings who are skilled in means perfect their cultivation of the six perfections as they hear mean utterances, mean words, scolding, and words of intimidation spoken by someone else, Sāgaramati?

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ངན་དུ་བརྗོད་པ་དང་ངན་དུ་སྨྲས་པའི་ཚིག་གི་ལམ་དང་། གཤེ་བ་དང་བསྡིགས་པ་དག་ཕ་རོལ་ལས་ཐོས་ན་དྲན་པ་འདི་ལྟ་བུ་རབ་ཏུ་འཐོབ་སྟེ
en: “Sāgaramati, when bodhisattva great beings hear mean utterances, mean words, scolding, and words of intimidation spoken by someone else they bring the following to mind:

source: སེམས་ཅན་འདི་ནི་སྔོན་ནས་སེར་སྣ་ཅན་དུ་གྱུར་པ་འཇུངས་པ་སྟེ།
en: ‘This person has long been stingy and miserly.

source: སེར་སྣའི་དྲི་མས་ཀུན་ནས་ཀུན་ཏུ་བསྐོར་བ་དེས་གང་དག་དེའི་གནོད་སེམས་ཀྱི་དྲི་མ་སྤང་བའི་ཕྱིར།
en: His life revolves around this stain of stinginess, such that he has now also developed malice.

source: ཆོས་སྟོན་པའི་དགེ་བའི་བཤེས་གཉེན་རྣམས་ལ་མ་བསྟེན། གུས་པར་མ་བྱས་བསྙེན་བཀུར་མ་བྱས་པའོ། །
en: As such, he does not follow spiritual friends who can teach him the Dharma, nor does he respect or serve them.

source: བདག་ནི་གཏོང་བ་ལ་མོས་ཤིང་སེར་སྣ་མེད་པར་བྱ། དགེ་བའི་བཤེས་གཉེན་ལ་བརྟེན་པར་བྱ། བསྙེན་པར་བྱ། བསྙེན་བཀུར་བྱའོ་སྙམ་སྟེ།
en: As for myself, I must remain inspired to give and not be stingy. I must continue to rely on, honor, and serve spiritual friends.’

source: དེ་དག་བསྲུང་ཞིང་གནོད་སེམས་ཀྱང་སྤོང་བ་འདི་ནི་དེའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Thus they are cautious and discard their malice, and this is their perfection of generosity.

source: གཞན་ཡང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “They also have the following thought:

source: སེམས་ཅན་འདི་ནི་ཚུལ་ཁྲིམས་འཆལ་པ་ལས་མ་མཐོང་བ་སྟེ། དེ་ནི་བདག་ལ་གཤེ་ཞིང་བསྡིགས་པའོ། །
en: ‘This person has nothing but perverse morality and yet he is scolding and intimidating me.

source: བདག་ནི་ཚུལ་ཁྲིམས་དང་བརྟུལ་ཞུགས་ཡང་དག་པར་བླངས་པ་ལས་མི་ཉམས་པར་བྱའོ། །
en: But I will not retreat from how I keep to my trainings of discipline and asceticism.

source: གནོད་སེམས་མེད་པར་བྱའོ། །
en: I will not become malicious.

source: བྱང་ཆུབ་ཀྱི་སེམས་ཡོངས་སུ་བསྲུང་བར་བྱའོ། །
en: I will uphold the mind of awakening.

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་བསྟེན་པར་བྱའོ་སྙམ་པ་
en: I will trust in the ripening of karma.’

source: འདི་ནི་དེའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This is their perfection of discipline.

source: སེམས་ཅན་འདི་ནི་ཞེ་སྡང་གི་ཤས་ཆེ་ཞིང་གནོད་སེམས་མང་བ་སྟེ། དེ་ནི་བདག་ལ་གཤེ་ཞིང་བསྡིགས་པའོ། །
en: ‘This person is aggressive and has so much malice, so he scolds and intimidates me.

source: བདག་ནི་བཟོད་པའི་སྟོབས་མང་དུ་བྱས་ཏེ།
en: Yet I will develop the strength of my patience.

source: བྱམས་པ་ལ་གནས་པར་བྱའོ་སྙམ་པ་འདི་ནི་དེའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: I will keep to love.’ This is their perfection of patience.

source: སེམས་ཅན་འདི་ནི་ལེ་ལོ་ཅན་དགེ་བའི་ཆོས་དང་བྲལ་བ་སྟེ་དེ་ནི་བདག་ལ་གཤེ་ཞིང་བསྡིགས་པའོ། །
en: ‘This person is lazy and devoid of virtuous qualities, so he scolds and intimidates me.

source: བདག་ནི་བརྩོན་འགྲུས་བརྩམ་པར་བྱ།
en: Yet I will remain diligent.

source: དགེ་བའི་རྩ་བ་ཡོངས་སུ་བཙལ་བར་བརྩོན་པ་ལ་མི་ངོམས་པར་བྱ་སྟེ།
en: I will never be satisfied in my pursuit of roots of virtue.

source: སེམས་ཅན་འདི་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་སྔར་ཇེ་འཇུག་པར་བྱས་ལ་ཕྱིས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ་སྙམ་དུ།
en: Sooner or later, I wish to make this person arrive at the seat of awakening, and thus make him fully awaken to unsurpassed and perfect buddhahood.’

source: དེ་ལྟར་གོ་ཆ་གྱོན་པ་འདི་ནི་དེའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This manner of donning armor is their perfection of diligence.

source: སེམས་ཅན་འདི་ནི་བརྗེད་ངས་པ། ཤེས་བཞིན་མེད་པ།
en: ‘This person is forgetful and not introspective.

source: ཉོན་མོངས་པ་ངེས་པར་བསམས་པ་སྟེ། དེ་ནི་བདག་ལ་གཤེ་ཞིང་བསྡིགས་པའོ། །
en: He does not consider his afflictive emotions, so he scolds and intimidates me.

source: བདག་ནི་ཉོན་མོངས་པ་ངེས་པར་བསམ་པར་བྱ།
en: Yet I can consider my afflictive emotions.

source: དྲན་པ་དང་ཤེས་བཞིན་ཅན་དུ་བྱ།
en: I can be mindful and introspective.

source: རྩེ་གཅིག་ཏུ་བྱང་ཆུབ་ཀྱི་སེམས་མི་བརྗེད་པར་བྱ་སྟེ།
en: I will one-pointedly remember the mind of awakening.

source: སེམས་ཅན་མ་དུལ་བ། མ་ཞི་བ། མ་སྦས་པ། ཉེ་བར་མ་ཞི་བ་འདི་ལྟ་བུ་དག་གི་དོན་དུ་བདག་གིས་གོ་ཆ་ཆེན་པོ་བགོས་ཏེ་འདི་ལྟར་སེམས་ངེས་པར་སེམས་སུ་གཞུག་གོ། །སྙམ་པ་འདི་ནི་དེའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: I will don strong armor for the sake of this untamed, aggressive, uncontrolled, and wild person.’ This is their perfection of concentration.

source: སེམས་ཅན་འདི་ནི་ཤེས་རབ་འཆལ་པ།
en: ‘This person has faulty insight.

source: བདག་ཏུ་སྨྲ་བ། སེམས་ཅན་དུ་ལྟ་བར་དམིགས་པའི་སྤྱོད་ཡུལ་བ་སྟེ་དེ་ནི་བདག་ལ་གཤེ་ཞིང་བསྡིགས་པའོ། །
en: He advocates the existence of a self and believes in the existence of a sentient being. So, he scolds and intimidates me.

source: བདག་ནི་ཆོས་ཉིད་ལ་བསྟེན་པར་བྱའོ་སྙམ་སྟེ་
en: Yet I will base myself on reality.’

source: འདི་ལ་གཤེ་བ་དང་ཁྲོ་བ་སུ་ཡིན་ཞེས་དེས་ཡོངས་སུ་ཚོལ་བ་ན་གང་གཤེ་བ་དང་ཁྲོ་བའི་ཆོས་དེ་མི་དམིགས་སོ། །
en: Thus, examining who is scolding or being aggressive, they fail to find anyone.

source: དེ་བདག་དང་གཞན་མི་དམིགས་པར་ལྟ་བ་དང་བྲལ་བར་བཟོད་པ་འདི་ནི་དེའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This acceptance that is free of any apprehension of self and other is their perfection of insight.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟར་ན་ཐབས་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ངན་དུ་བརྗོད་པ་དང་ངན་དུ་སྨྲས་པའི་ཚིག་གི་ལམ་དང་། གཤེ་བ་དང་བསྡིགས་པ་དག་ཕ་རོལ་ལས་ཐོས་ནས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞིང་ཐེག་པ་ཆེན་པོ་དེ་ལས་ཀྱང་མི་ཉམས་ཏེ་
en: “Thus, Sāgaramati, when bodhisattvas who are skilled in means hear mean utterances, mean words, scolding, and words of intimidation spoken by someone else, they complete their cultivation of the six perfections and do not fall away from the Great Vehicle.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ངག་གི་གནོད་པ་བཟོད་པའོ། །
en: This is the bodhisattvas’ acceptance of verbal harm.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཀྱི་གནོད་པ་བཟོད་པ་གང་ཞེ་ན།
en: “What is the bodhisattvas’ acceptance of mental harm, Sāgaramati?

source: གང་བདུད་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་ཀྱི་སེམས་དེ་ལས་ཕྲལ་ཡང་མི་གཡོ་བ་དང་། ཕས་ཀྱི་རྒོལ་བ་དམིགས་པར་ལྟ་བ་ལ་མངོན་པར་ཞེན་པ་ཐམས་ཅད་ཀྱིས་ཡང་དག་པའི་བསམ་པར་ཞུགས་པ་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེ་ལས་མོས་པ་བཟློག་ཀྱང་མི་བརྗེད་པ་དང་།
en: All māras, who unwaveringly try to separate others from the mind of awakening, and all obstructers, who are attached to ideologies, will continually attempt to undermine those who have set forth with a genuine intention to gain omniscience.

source: སངས་རྒྱས་ཀྱི་གཟུགས་སུ་འདུག་ཀྱང་མི་མཉམ་པ་དང་མཉམ་པའི་སེམས་དེ་ལས་ཉམས་པར་བྱེད་མི་ནུས་ཏེ་
en: Nevertheless, such bodhisattvas do not forget their goal and even if they were to meet the Buddha in person, he would not be able to diminish their unequaled attitude.

source: བདུད་རྫུ་འཕྲུལ་རབ་ཏུ་ཆེན་པོ་དག་གིས་ཁྱོད་ཀྱིས་ཐེག་པ་ཆེན་པོ་ཡང་དག་པར་བསྒྲུབ་པར་མི་ནུས་ཀྱིས་
en: Such māras of incredible magical power will say, ‘You cannot authentically accomplish the Great Vehicle!

source: ཁྱོད་ཀྱིས་གཅེས་པར་བྱ་བ་འདི་ཐོང་ཤིག །
en: You should give up cherishing this goal!

source: ཁྱོད་ཀྱིས་བརྩོན་འགྲུས་འདི་འོར་ཅིག །
en: Give up your diligence!

source: བྱང་ཆུབ་ནི་རྙེད་པར་དཀའ་བ།
en: Awakening is difficult to attain.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་རྙེད་པར་དཀའ་བ་སྟེ་འདིར་འཁོར་བའི་སྡུག་བསྔལ་མང་དུ་མྱོང་བར་འགྱུར་རོ། །
en: The qualities of buddhahood are difficult to find. You will continue to experience the suffering of saṃsāra.

source: གང་དག་མྱ་ངན་ལས་འདས་པ་དེ་དག་ནི་བདེ་བ་ཡིན་གྱིས་སྐྱེས་བུ་དམ་པ་ཁྱོད་མྱུར་དུ་མྱ་ངན་ལས་འདས་པར་གྱིས་ཤིག་ཅེས་དེའི་སེམས་སྐུལ་ཞིང་སེམས་དྲན་པར་བྱེད་ལ།
en: The state of nirvāṇa is blissful. Sublime being, you should hasten to nirvāṇa.’ Thus they try to influence and sway the bodhisattva.

source: བློ་གྲོས་རྒྱ་མཚོ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་དེ་ལྟར་བྲལ་བར་བྱེད་དེ་ལྟར་མོས་པ་ཟློག་པར་བྱེད་ཀྱང་སྔོན་གྱི་གོ་ཆ་མི་འདོར་ཞིང་བསམ་པ་རྣམ་པར་འཁྲུགས་པར་མི་བྱེད་ཀྱི་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “Sāgaramati, if bodhisattva great beings do not relinquish their armor, or let themselves become disturbed, when the māras attempt to destroy and undermine their intention, they will think,

source: བདག་གིས་ངེས་པར་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མནན་པར་བྱ།
en: ‘I must reach the seat of awakening!

source: བདག་གིས་ངེས་པར་བདུད་དཔུང་དང་བཅས་པར་འཕམ་པར་བྱས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ།
en: I must defeat the māras and their hordes and fully awaken to unsurpassed and perfect buddhahood!

source: བདག་གིས་ངེས་པར་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བར་བྱ།
en: I will definitely turn the wheel of Dharma!

source: བདག་གིས་ངེས་པར་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་ཆོས་ཀྱི་གཏམ་ཆེན་པོ་བརྗོད་པར་བྱ།
en: I will explain the great message of the Dharma to the trichiliocosm.

source: བདག་གིས་སེམས་ཅན་ཐམས་ཅད་མགྲོན་དུ་གཉེར་ལ་ཆོས་ཀྱི་སྦྱིན་པས་ཚིམ་པར་བྱའོ། །
en: I will regale all beings and satisfy them with the gift of Dharma!

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་། བདག་དང་གཞན་གྱི་སེམས་རིག་པའི་ལྷ་རྣམས་ཀྱིས་བྱང་ཆུབ་ཏུ་བསམ་པ་རིག་གིས།
en: All buddhas and bodhisattvas, as well as the gods who are cognizant of their own and others’ minds, realize my intention to awaken.

source: བདག་གིས་ཐམས་ཅད་མཁྱེན་པའི་སེམས་ཀྱི་གནོད་པ་བཟོད་པར་བྱའོ། །
en: I will accept all challenges to the mind of omniscience.

source: སངས་རྒྱས་རྣམས་དང་ལྷ་རྣམས་དང་སེམས་ཅན་ཐམས་ཅད་དང་བདག་ལ་བསླུ་བར་མི་བྱའོ་
en: No buddha, god, or any other being will cheat me of this!’

source: བློ་གྲོས་རྒྱ་མཚོ་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཀྱི་གནོད་པ་བཟོད་ཅིང་།
en: “Sāgaramati, such is the bodhisattvas’ acceptance of mental harm;

source: ཐེག་པ་ཆེན་པོ་དེ་ལས་མི་ཕྱེད་པ་སྟེ།
en: thus they cannot be separated from the Great Vehicle.

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ནི་ཐམས་ཅད་མཁྱེན་པར་སེམས་བསྐྱེད་པ་རིན་པོ་ཆེ་དེའི་གནོད་པ་བཟོད་པའོ། །
en: Sāgaramati, this is how they accept all challenges to the jewel of developing the mind directed toward omniscience.

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གོ་ཆ་གང་ཡིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གོང་ན་མེད་པ་གང་ཡིན་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་གཉིས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཀྱི་གནོད་པ་བཟོད་པའོ། །
en: It is by perfecting the armor of the perfection of patience and the unsurpassable perfection of diligence that bodhisattvas accept mental harm.”

source: བྱང་ཆུབ་ལམ་ལས་བསམ་པ་མི་ཕྱེད་ཅིང་། །དེ་ནི་སྙིང་རྗེ་ལས་ཀྱང་ཕྱེད་མ་ཡིན། །
en: “Not letting our intention drift from the path of awakening, Nor from compassion,

source: བདག་གིས་དཀོན་མཆོག་གསུམ་པོ་བསྲུང་བར་བྱ། །སངས་རྒྱས་ཆོས་རྣམས་ཡང་དག་བསྒྲུབ་པར་བྱ། །
en: We must protect the Three Jewels And manifest the qualities of buddhahood.

source: སུམ་ཅུ་རྩ་གཉིས་ཁྱད་འཕགས་མཚན་དང་དཔེ་བྱད་བཟང་། །གང་དག་གིས་ནི་སྟོབས་བཅུ་རྣམས་ཀྱིས་ལུས་མཛེས་པ། །དེ་དག་ཡོངས་སུ་བཙལ་ཕྱིར་མཆོད་སྦྱིན་བྱེ་བ་བྱེད། །
en: “The exalted thirty-two major marks, and the minor marks of excellence, And bodies beautified by the ten strengths — In search of these, we make countless offerings.

source: གནོད་པ་ཤིན་ཏུ་རྣམ་མང་བཟོད་ཅིང་ཡོན་ཏན་ཕྱུག །
en: We accept myriad types of adversity and become rich with qualities.

source: བརྒྱ་ཕྲག་མཐའ་ཡས་ཞིང་རྣམས་དེ་དག་བདག་གིས་སྦྱང་། །
en: “We will refine countless thousands of fields.

source: རིན་ཆེན་ཆོས་མཆོག་འདི་དག་བདག་གིས་བསྲུང་བར་བྱ། །
en: We will uphold the supreme Dharma jewel.

source: བརྒྱ་ཕྲག་མཐའ་ཡས་སེམས་ཅན་དེ་དག་བདག་གིས་དགྲོལ། །
en: We will liberate countless thousands of beings.

source: དེས་ན་གནོད་པ་བཟོད་ཅིང་བསམ་པ་མི་ཕྱེད་དོ། །
en: Thus, we accept adversity and do not let our intention drift away.

source: ཕྱོགས་བཅུའི་སེམས་ཅན་ཁམས་ནི་མཐའ་ཡས་ཇི་སྙེད་པ། །ཐམས་ཅད་འདུས་པར་གྱུར་ནས་ལག་ན་མཚོན་ཐོགས་ཏེ། །
en: “Even if the beings of the countless realms in the ten directions Were to gather together, brandishing weapons, And threaten, insult, and intimidate us,

source: དེ་དག་དེ་ལ་འཇིགས་སྦྱིན་གཤེ་ཞིང་བསྡིགས་བྱེད་ཀྱང་། །ཡོན་ཏན་ཕྱིར་ནི་བསྡིགས་དང་འཕྱ་བ་བཟོད་པར་བྱེད། །
en: We shall bear such intimidation and jeers for the sake of qualities.

source: སྔོན་མཐའི་བསྐལ་པ་བརྒྱ་ཕྲག་མཐའ་ཡས་ཇི་སྙེད་པར། །དེ་དག་རྒྱུན་མི་འཆད་པར་ཚིག་རྩུབ་སྨྲས་ཀྱང་ནི། །བདག་ཉིད་ཆེན་པོ་དེ་བཟོད་མི་ཁྲོ་གཤེ་བ་མེད། །
en: “Even though they have been verbally abused Continuously for countless eons in the past, Great beings will accept this, allowing no anger or rebukes.

source: དེ་ལྟར་རྟོགས་པ་རྣམས་ནི་གནོད་པ་དག་པར་འགྱུར། །
en: Those who realize this fact will purify adversity.

source: སེམས་ཅན་དེ་དག་ལག་ན་མཚོན་ཐོགས་ལྷན་ཅིག་ཏུ། །བདག་གི་ལུས་ཀྱི་ཡན་ལག་དུམ་བུ་དུམ་བུར་གཏུབས། །
en: “Beings could band together and, bearing weapons, Chop our bodies into many tiny pieces.

source: འོན་ཀྱང་བདག་གི་སེམས་ཡིད་ཁྲོ་བར་མི་བྱ་སྟེ། །
en: Yet our minds will not become angry.

source: བྱང་ཆུབ་ཡིད་ལ་བྱས་ན་གནོད་འདི་དག་པར་འགྱུར། །
en: When the mind has turned to awakening, such adversity is purified.

source: འགྲེང་ངམ་འདུག་གམ་འཆག་གམ་འོན་ཏེ་ཉལ་ཡང་རུང་། །གང་དུ་བྱང་ཆུབ་སེམས་མཆོག་
en: “Wherever we are standing, sitting, walking, or lying down, We always maintain this supreme mind of awakening.

source: འདི་དག་སྦྱིན་པ་དང་། །དུལ་བའི་སེམས་དང་གཞན་ཡང་དཀར་སེམས་མི་འདོར་བ། །དེར་ནི་དེའི་ལུས་དུམ་བུ་དུམ་བུར་རྣམ་པར་འཐོར། །
en: We do not give up our generosity, or our disciplined and virtuous mind, Even if our bodies are ripped to pieces.

source: སེམས་དམྱལ་དུད་འགྲོའི་སྐྱེ་གནས་ཡི་དགས་འཇིག་རྟེན་མིར། །བསྐལ་པ་བརྒྱ་ཕྲག་མཐའ་ཡས་དོན་མེད་ལུས་ཀྱང་གཏུབས། །
en: “While the mind is in the realms of hell, animals, hungry ghosts, or humans, The body is slain meaninglessly for countless eons.

source: སངས་རྒྱས་ཡེ་ཤེས་མངོན་པར་འདོད་པས་ལུས་འདོར་ཞེས། །སྐྱེས་བུ་དེས་ནི་ཡིད་ཀྱང་ཡང་དག་ཚིམ་པར་བྱེད། །
en: Yet the message ‘discard the body if you yearn for buddha wisdom’ Brings true satisfaction to such beings.

source: མི་ཡི་སྡུག་བསྔལ་རྒྱུ་ནི་རྣམ་པ་དུ་མ་དག །མཚམས་མེད་སྡུག་བསྔལ་བརྒྱ་ཆར་ཉེ་བར་མི་འགྲོ་བའི། །
en: “There are myriad causes of human suffering, But they are not even a hundredth of the suffering in the hell of immediate retribution.

source: དམྱལ་བ་རྣམས་སུ་བསྐལ་པ་བརྒྱར་ནི་གནས་པར་སྤྲོ། །རྒྱལ་བ་དང་ནི་ཆོས་དང་སེམས་ཅན་མི་གཏོང་ངོ་། །
en: Still, the victors would delight to spend a hundred eons in the hells, And will never give up on beings or the Dharma.

source: བདག་ལུས་མི་རྟག་རིང་དུ་མི་ཐུབ་སྒྱུ་མ་འདྲ། །ཁམས་བཞི་དེ་དག་གདུག་པའི་སྦྲུལ་དང་འདྲ་བར་གསུངས། །
en: “It is said that our bodies are impermanent, short-lived, and like illusions, And that the four elements are like malevolent serpents.

source: བདག་གིས་ལུས་བོར་བྱས་ཏེ་དུག་མེད་འགྱུར་བར་བྱ། །
en: When we discard the body, they are deprived of their poison;

source: ཉོན་མོངས་དུག་ཞི་ནས་ནི་རང་བྱུང་སངས་རྒྱས་འགྱུར། །
en: The poison of the afflictive emotions is pacified, and buddhahood naturally occurs.

source: སྲིད་གསུམ་འཇིག་རྟེན་འདི་ནི་ལུས་བདེ་འགྱུར་བའི་གཞི། །འདོད་པའི་ཟས་རྒྱུ་ཅུང་ཟད་ཇི་སྙེད་འཇིགས་པ་སྟེ། །
en: “The three realms of existence are the basis for all bodily pleasure, Yet all its causes of desire are embedded in anxiety.

source: བདག་གིས་ལུས་བཏང་འཇིགས་པ་མེད་པར་འགྱུར་བར་བྱ། །
en: We must achieve fearlessness by giving up the body.

source: བགྲང་བ་འདི་ལ་ཞུགས་པ་དེ་དག་གནོད་པ་བཟོད། །
en: With this understanding, we come to accept adversity.

source: ནག་པོའི་ཕྱོགས་ལ་གྲོགས་ནི་བརྒྱ་སྟོང་ཕྲག་ཀྱང་མང་། །དཀར་པོའི་ཕྱོགས་ནི་གང་ལའང་གྲོགས་པོ་གཅིག་པུར་འགྱུར། །
en: “Those who would accompany you to evil are legion, And in any positive direction, you will likely be your sole companion.

source: བདག་ནི་མི་དགེ་རྣམས་དང་རྩོད་པར་མི་བྱ་སྟེ། །
en: We pledge to not fight or do anything nonvirtuous.

source: སངས་རྒྱས་བཟོད་པ་གསུངས་པས་བཟོད་པ་བདག་གི་གྲོགས། །
en: The buddhas speak of patience, so patience will be our companion.

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་དེ་དག་འདིར་ནི་བདག་གི་དཔང་། །
en: “We take the buddhas of the ten directions as our witness.

source: ཇི་ལྟར་སངས་རྒྱས་སྐུ་ལ་སེམས་ནི་མི་ཕྱེད་དེ། །སངས་རྒྱས་དང་ནི་བདག་ཉིད་ཆེ་ལྷ་བདག་གི་གྲོགས། །
en: Since our minds have not parted from the buddha body, Our companions are the buddhas and great divine beings.

source: གནོད་པ་བཟོད་པར་བྱ་ཡི་སྡང་བར་མི་བྱའོ། །
en: We shall accept adversity and not become upset.

source: གནོད་པ་ལུས་དང་ངག་ཡིད་རྣམ་པ་གསུམ་དུ་གསུངས། །
en: “Harm is said to come physically, verbally, and mentally.

source: གང་བཟོད་དཔའ་བོ་དེ་ནི་མི་ཕྱེད་བཟོད་པ་ཡིན། །
en: Heroes who can accept anything never lose their patience.

source: ལུས་ཀྱི་སྡུག་བསྔལ་རྣམ་པ་མཐའ་ཡས་ཡོད་པ་དག །གལ་ཏེ་ལུས་ལ་བཟོད་པ་ལུས་གནོད་དག་པར་འགྱུར། །
en: Physical suffering can come in infinite varieties, But if you accept what happens to the body, physical harm is purified.

source: ལུས་ནི་དུམ་བུ་དུམ་བུར་གཏུབས་ཏེ་རྣམ་གཏོར་ཚེ། །ཐབས་ལྡན་ཆེ་བའི་བདག་ཉིད་ཕ་རོལ་ཕྱིན་རྫོགས་འགྱུར། །
en: “When the bodies of great beings are cut into tiny pieces and scattered about, Such skillful beings complete the perfections.

source: སྦྱིན་དང་ཚུལ་ཁྲིམས་བཟོད་དང་བརྩོན་འགྲུས་བསམ་གཏན་དང་། །ཤེས་རབ་ཁྱད་འཕགས་དམ་པ་སྐད་ཅིག་ཙམ་གྱིས་འཛིན། །
en: Generosity, discipline, patience, diligence, concentration, and insight: High and noble beings can uphold them all in a moment.

source: ལུས་དང་ལུས་ལ་སྲེད་པའི་ཉོན་མོངས་རྣམས་ཀྱང་འདོར། །སྦྱིན་དང་རབ་ཏུ་ལྡན་པའི་ཕ་རོལ་ཕྱིན་པར་འགྱུར། །
en: “Casting aside the body and those afflictions that crave the body, Is to acquire the perfection of generosity.

source: བྱམས་པས་འཇིག་རྟེན་ཁྱབ་བྱེད་ཚུལ་ཁྲིམས་ཉམས་མི་འགྱུར། །
en: When love pervades the world, discipline cannot deteriorate.

source: བྱང་ཆུབ་རྗེས་སུ་འགྲོ་བས་ཚུལ་ཁྲིམས་དག་པ་འཛིན། །
en: By then proceeding toward awakening, discipline is pure.

source: བཟོད་པའི་སྟོབས་བསྐྱེད་ཡན་ལག་རྣམས་དང་ཉིང་ལག་གཅོད། །དེ་ཡང་དེ་ཡི་བཟོད་པའི་ཕ་རོལ་ཕྱིན་ལ་སྦྱོར། །
en: “Arousing the strength of patience when one’s limbs and digits are cut off Is to train in the perfection of patience.

source: བརྩོན་འགྲུས་གཅེས་པ་མ་ཞུམ་བར་སྐབས་སྒྱིད་ལུག་མེད། །ལུས་ནི་རྣམ་པར་འཐོར་ཞིང་བརྩོན་འགྲུས་ཕ་རོལ་འགྲོ། །
en: Cherishing diligence, avoiding discouragement, and giving self-deprecation no chance Allows you to scatter bodily concern and perfect diligence.

source: བྱང་ཆུབ་སེམས་ཀྱི་བསམ་པ་དྲན་པ་མི་འདོར་ཞིང་། །
en: “Do not lose mindfulness of the mind of awakening.

source: ཉོན་མོངས་མུན་པའི་རྡུལ་རྣམས་བསལ་ཕྱིར་རབ་ཏུ་བརྩོན། །
en: Be very diligent to clear away the obscuring dust of the afflictions.

source: ལུས་བཤིག་ནས་ནི་བསམ་གཏན་སྟོབས་དང་རྣམ་ཐར་འཐོབ། །
en: When the body is destroyed, you will attain the power of concentration and freedom.

source: འདིར་ཡང་རྡུལ་བྲལ་བསམ་གཏན་ཕ་རོལ་ཕྱིན་ལ་སྦྱོར། །
en: Then you will train in the stainless perfection of concentration.

source: བདག་གི་ལུས་ནི་བདག་མེད་རྨི་ལམ་གློག་དང་འདྲ། །
en: “Our bodies lack intrinsic nature, and are like dreams or flashes of lightning.

source: འདི་ལ་བྱེད་པ་པོ་མེད་ཚོར་བ་པོ་ཡང་མེད། །
en: There is no real agent in there, nor one who feels.

source: ལུས་ཀྱི་གཟིངས་པས་བཅིངས་པའི་སེམས་ཅན་བདག་གིས་དགྲོལ། །
en: We liberate beings who are bound by bodily ties.

source: ཤེས་རབ་འདི་ནི་ཁྱད་འཕགས་ཕ་རོལ་ཕྱིན་པ་མཆོག །
en: This insight is the noble supreme perfection.

source: གང་ཞིག་འདི་ལ་སྦྱོར་ཞིང་ཚུལ་བཞིན་ཆོས་སེམས་ལ། །ལུས་ཀྱི་གནོད་པ་བཟོད་ཅིང་རབ་སྡང་མི་བྱེད་དེ། །
en: “Whoever can keep to this training and regard the Dharma appropriately, Will be able to accept physical harm and avoid becoming furious.

source: མི་སྙན་པ་དང་སྨད་དང་བཤུང་བའི་ཚིག་ཐོས་ཀྱང་། །དེ་ནི་ཞེ་སྡང་མི་འགྱུར་བྱམས་ལྡན་སེམས་ཀྱང་དུལ། །
en: Even upon hearing blame, insults, and slander, One will not become angry, but remain gentle, with a loving mind.

source: ཐ་བ་རབ་ཏུ་ཞེ་སྡང་བོར་འདི་སྦྱིན་པ་དག །
en: “Eliminating rigidity and aggression purifies generosity.

source: བྱམས་པའི་ཡིད་དུ་གྱུར་པ་འདི་ནི་ཚུལ་ཁྲིམས་དག །
en: Making the mind more loving purifies discipline.

source: བཟོད་པའི་སྟོབས་བསྐྱེད་འདི་ནི་བཟོད་པ་དག་པ་ཡིན། །
en: Strengthening one’s capacity for acceptance purifies patience.

source: སངས་རྒྱས་ཡེ་ཤེས་འདོད་ནས་བརྩོན་འགྲུས་ཕྱིར་ཞིང་སྐྱེད། །
en: When you desire buddha wisdom, diligence is developed.

source: སེམས་དང་ཡིད་རབ་ཞི་བ་འདི་ནི་བསམ་གཏན་དག །
en: “Bringing peace to all facets of mind purifies concentration.

source: སྒྲ་སྐད་མི་རྙེད་འདི་ནི་ཤེས་རབ་དག་པ་ཡིན། །
en: Seeing that sound and language are unidentifiable is the purification of insight.

source: མི་ཡི་ཚིག་ཐོས་ནས་ནི་གང་ཆོས་འདི་སེམས་པ། །
en: When one hears human speech, it will cause one to reflect on the Dharma.

source: དེ་འདིར་གནོད་བཟོད་དག་གི་སྐྱོན་ལ་ཆགས་པ་མེད། །
en: Thus they accept harm and have no attachment to the defects of speech.

source: བདུད་དང་མུ་སྟེགས་ཅན་གྱི་ལྟ་གྱུར་བརྒྱ་སྟོང་གིས། །གནས་འདི་རྙེད་དཀས་སྦྱོར་བ་འོང་བརྗོད་ཀྱང་། །མི་སྐྲག་ཞུམ་པ་མེད་ཅིང་ཕྱི་ཕྱིར་མཐུ་བསྐྱེད་དེ། །
en: “Through the myriad views held by māras and non-Buddhists, This point is hard to realize and so, no matter what such beings prescribe, Learned beings remain unafraid, unyielding, and increase their strength.

source: མཁས་པ་དེ་ནི་གནོད་དང་སེམས་གནོད་མཐའ་ཡས་བཟོད། །
en: Thus they bear with endless mental challenges.

source: གང་ཞིག་བཟོད་དང་བརྩོན་འགྲུས་རབ་གནས་རི་རབ་འདྲ། །སེམས་ཅན་ཀུན་ནང་དཔའ་བོ་དེ་འདིར་གནོད་པ་བཟོད། །
en: “Those whose patience and diligence are stable like Mount Meru, Are the greatest heroes among all beings and will be able to accept adversity.

source: སྟོབས་བཅུ་རྣམས་ཀྱི་སྦྱང་བ་དང་ནི་གནོད་ཤེས་ནས། །
en: They train in the ten strengths and come to understand adversity.

source: བྱང་ཆུབ་རྗེས་སུ་འགྲོ་བས་ཕྱི་ནས་ལུང་སྟོན་ཏོ། །
en: Approaching awakening, they will receive their prophecy.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལ་ཐམས་ཅད་མཁྱེན་པར་སེམས་བསྐྱེད་པ་རིན་པོ་ཆེ་དེའི་འབིགས་པ་གང་ཞེ་ན།
en: “Sāgaramati, how does one internalize the jewel that develops the mind directed toward omniscience?

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་མཁྱེན་པར་སེམས་བསྐྱེད་པ་རིན་པོ་ཆེ་དེས་རློམ་སེམས་སུ་མི་བྱེད་དེ།
en: Sāgaramati, bodhisattva great beings avoid becoming conceited through the jewel that develops the mind directed toward omniscience.

source: ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེ་ལ་བརྟེན་པར་མི་བྱེད་གནས་པར་མི་བྱེད། ལེན་པར་མི་བྱེད། འདོར་བར་མི་བྱེད། སྤྲོས་པར་མི་བྱེད། རྟོག་པར་མི་བྱེད།
en: They do not depend on, settle in, take up, discard, ponder, think about, or conceptualize the mind directed toward omniscience.

source: རྣམ་པར་རྟོག་པར་མི་བྱེད་ཀྱི་རྣམ་པར་རྟོག་པར་ཉེ་བར་ཞི་བ་ལ་གནས་པ་ཡིན་ཏེ།
en: They sustain the pacification of conceptuality.

source: དེ་ཆོས་ཟབ་མོ་རྣམས་ལ་བློས་རྣམ་པར་དཔྱོད་དོ། །
en: They mentally investigate profound subjects.

source: ཆོས་ཟབ་མོ་དེ་དག་གང་ཞེ་ན།
en: What are these profound subjects?

source: འདི་ལྟ་སྟེ། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ལུགས་སུ་འབྱུང་བ་དང་། རྒྱུ་ལ་དམིགས་པ་ཁོང་དུ་ཆུད་པ་དང་། རྟག་པ་མ་ཡིན་པ་དང་། ཆད་པ་མ་ཡིན་པ་དང་། མཐར་ལྟ་བ་དང་བྲལ་བ་དང་། རང་བཞིན་གྱིས་བདག་མེད་པ་དང་། བདག་ངོ་བོ་ཉིད་མེད་པས་ཆོས་ཐམས་ཅད། ངོ་བོ་ཉིད་མེད་པ་དང་། གདོད་མ་ནས་མ་སྐྱེས་པ་དང་། མ་བྱུང་བ་དང་།
en: “They are; the occurrences of dependent origination, the understanding of causes, what is not eternal, what is not disrupted, what is free from extreme views, what is naturally without a self, and the fact that all phenomena are unreal, primordially unborn, and nonarising because the self is unreal.
